ZeroToHero/SOAPBodyXml/Create.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Create xmlns="urn:microsoft-dynamics-schemas/page/employeepage">
      <EmployeePage>
        <EmployeeId>2001</EmployeeId>
        <EmployeeName >Rahul</EmployeeName>
        <EmployeeAge>21</EmployeeAge >
      </EmployeePage>
    </Create>
  </soap:Body>
</soap:Envelope>